<a href="https://colab.research.google.com/github/souchie1/DIO-primeiro-repositorio/blob/main/OFICINA_BD_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
CREATE TABLE Cliente (
    ID INT PRIMARY KEY,
    Nome VARCHAR(255),
    Telefone VARCHAR(20),
    Endereço VARCHAR(255)
);

CREATE TABLE Carro (
    ID INT PRIMARY KEY,
    Modelo VARCHAR(50),
    Ano INT,
    Placa VARCHAR(10),
    Cliente_ID INT,
    FOREIGN KEY (Cliente_ID) REFERENCES Cliente(ID)
);

CREATE TABLE Serviço (
    ID INT PRIMARY KEY,
    Descrição VARCHAR(255),
    Preço DECIMAL(10, 2)
);

CREATE TABLE OrdemDeServiço (
    ID INT PRIMARY KEY,
    Carro_ID INT,
    Data DATE,
    Total DECIMAL(10, 2),
    Observações TEXT,
    FOREIGN KEY (Carro_ID) REFERENCES Carro(ID)
);

In [ ]:
INSERT INTO Cliente (ID, Nome, Telefone, Endereço) VALUES
    (1, 'João Silva', '123456789', 'Rua A, 123'),
    (2, 'Maria Souza', '987654321', 'Avenida B, 456');

INSERT INTO Carro (ID, Modelo, Ano, Placa, Cliente_ID) VALUES
    (1, 'Ford Focus', 2018, 'ABC123', 1),
    (2, 'Chevrolet Onix', 2020, 'DEF456', 2);

INSERT INTO Serviço (ID, Descrição, Preço) VALUES
    (1, 'Troca de Óleo', 50.00),
    (2, 'Reparo de Freios', 120.00);

INSERT INTO OrdemDeServiço (ID, Carro_ID, Data, Total, Observações) VALUES
    (1, 1, '2023-08-10', 70.00, 'Óleo + Mão de obra'),
    (2, 2, '2023-08-11', 200.00, 'Freios dianteiros');

In [ ]:
SELECT * FROM Cliente;

In [ ]:
SELECT * FROM Carro WHERE Cliente_ID = 1;

In [ ]:
SELECT c.Nome, SUM(os.Total) AS TotalGasto
FROM Cliente c
JOIN Carro car ON c.ID = car.Cliente_ID
JOIN OrdemDeServiço os ON car.ID = os.Carro_ID
GROUP BY c.ID, c.Nome;

In [ ]:
SELECT car.Modelo, s.Descrição, s.Preço
FROM Carro car
LEFT JOIN OrdemDeServiço os ON car.ID = os.Carro_ID
LEFT JOIN Serviço s ON os.ID = s.ID;

In [ ]:
SELECT c.Nome
FROM Cliente c
JOIN Carro car ON c.ID = car.Cliente_ID
JOIN OrdemDeServiço os ON car.ID = os.Carro_ID
JOIN Serviço s ON os.ID = s.ID
WHERE s.Descrição = 'Reparo de Freios';

In [ ]:
SELECT car.Modelo, car.Ano, s.Descrição
FROM Carro car
LEFT JOIN OrdemDeServiço os ON car.ID = os.Carro_ID
LEFT JOIN Serviço s ON os.ID = s.ID
ORDER BY car.Ano;

In [ ]:
SELECT c.Nome, SUM(os.Total) AS TotalGasto
FROM Cliente c
JOIN Carro car ON c.ID = car.Cliente_ID
JOIN OrdemDeServiço os ON car.ID = os.Carro_ID
GROUP BY c.ID, c.Nome
HAVING TotalGasto > 1000;